app/controllers/messages_controller.rb

  def index
    @all_u = User.all
    @message_all = Content.all
    @u = User.find(session[:user_id])
---
SELECT "users".* FROM "users"
SELECT "contents".* FROM "contents"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
      @user = User.find(params[:session_id])
      #content = Content.create(content: "\"#{params[:content]}\"")
      content = Content.create(content: params[:content])
      @user.contents << content
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "contents" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Bonjour lundi"], ["user_id", 1], ["created_at", "2019-02-11 06:05:45.829106"], ["updated_at", "2019-02-11 06:05:45.829106"]]
INSERT INTO "contents" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "je test le chat room"], ["user_id", 1], ["created_at", "2019-02-11 06:33:39.147409"], ["updated_at", "2019-02-11 06:33:39.147409"]]