app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Jean"], ["LIMIT", 1]]
---
  def create
    user_input_email = params[:name]
    user_input_password = params[:password]

    user = User.find_by(name: user_input_email)